YuSungyeon/Wifi_esp32/esp32s3_csi_send_poc/sdkconfig.defaults
# esp-csi csi_send 예제 기반. ESP-IDF v5.2.2 + ESP32-S3 타겟.
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_PARTITION_TABLE_OFFSET=0xa000
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=128
CONFIG_ESP_WIFI_CSI_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
# 필수: app_main 송신 루프가 usleep(10000)으로 100Hz를 만든다. tick이 100Hz(기본)면
# 10ms가 1 tick으로 반올림돼 실효 주기가 20ms(=50Hz)로 반토막 난다. 지우지 말 것.
CONFIG_FREERTOS_HZ=1000
